
&НаСервере
Процедура ГуидНаСервере()
	
	ПолноеИмяОбъекта = "Документ.Документ1";
	ГУИДОбъекта = "674e0f7c-1e77-11e2-af64-d48564666b50";
	
	МенеджерОбъекта = Документы.Документ1;
	
	ПараметрыВыбора = Новый Структура;
	//ПараметрыВыбора.Вставить("Отбор",Новый Структура);
    ПараметрыВыбора.Вставить("СтрокаПоиска","1");
	ПараметрыВыбора.Вставить("СпособПоискаСтроки",СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть);

   	
	Список = МенеджерОбъекта.ПолучитьДанныеВыбора(ПараметрыВыбора);
//	
//ОбъектСсылка = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДОбъекта));
//	
//	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
//		Ответ = Новый HTTPСервисОтвет(404);
//		Ответ.УстановитьТелоИзСтроки("Object by guid not found");
//	КонецЕсли;
	
	//СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ОбъектСсылка);

	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Гуид(Команда)
	ГуидНаСервере();
КонецПроцедуры
