
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьНастройуиПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройуиПоУмолчанию()
	
	ОбъектТестирования = 0;
	Объект.АдресHTTP = "http://82.202.253.117/RA_DO_DEV2/hs/exchange/Document_Nesootvetstvie";
	Объект.АдресOData = "http://82.202.253.117/RA_DO_DEV2/odata/standard.odata/Document_%D1%80%D0%B0_%D0%9D%D0%B5%D1%81%D0%BE%D0%BE%D1%82%D0%B2%D0%B5%D1%82%D1%81%D1%82%D0%B2%D0%B8%D0%B5";
	Объект.КоличествоПотоков = 20;
	Объект.КоличествоОбращений = 200;
	
	ЗаполнитьТаблицуКоличествоОбъектовВВыборке();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуКоличествоОбъектовВВыборке()
	
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 50;
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 150;
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 1000;
	КоличествоОбъектовВВыборке.Добавить().КоличествоОбъектов = 3000;
	
	КоличествоОбъектовВыделитьВсе("");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	ВыполнитьЗапросНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	
	ОчиститьСтатистику();
	
	ПараметрыТестирования = Новый Структура;
	ПараметрыТестирования.Вставить("ОбъектТестирования", ОбъектТестирования);
	ПараметрыТестирования.Вставить("АдресHTTP", Объект.АдресHTTP);
	ПараметрыТестирования.Вставить("АдресOData", Объект.АдресOData);
	ПараметрыТестирования.Вставить("КоличествоОбращений", Объект.КоличествоОбращений);
	
	МассивКоличествоОбъектов = Новый Массив;
	
	Для Каждого СтрокаТЗ ИЗ КоличествоОбъектовВВыборке Цикл
		
		Если НЕ СтрокаТЗ.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКоличествоОбъектов.Добавить(СтрокаТЗ.КоличествоОбъектов);
		
	КонецЦикла;
			
	ПараметрыТестирования.Вставить("МассивКоличествоОбъектов", МассивКоличествоОбъектов);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыТестирования);
	
	Для СчетчикПотоков = 1 По Объект.КоличествоПотоков Цикл
		МассивПараметров[0].Вставить("НомерПотока", СчетчикПотоков);
		Задание = ФоновыеЗадания.Выполнить("ТестированиеВебСервера.ВыполнитьОбращениеКВебСерверу", МассивПараметров);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьСтатистику()
	
	НЗ = РегистрыСведений.СтатистикаОбращений.СоздатьНаборЗаписей();
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОбъектовВыделитьВсе(Команда)
	
	Для Каждого СтрокаТЗ ИЗ КоличествоОбъектовВВыборке Цикл
		СтрокаТЗ.Использование = Истина;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОбъектовСнятьВсе(Команда)
	
	Для Каждого СтрокаТЗ ИЗ КоличествоОбъектовВВыборке Цикл
		СтрокаТЗ.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры


